/* Title for OK button in open panel used for adding new search paths to a target */
"Add" = "Add";

/* Title for open panel used for adding new search paths to a target */
"Add Search Paths" = "Add Search Paths";

/* Substring that will become part of the target build setting notice to represent any active build style (used when there's no currently active build style) */
"any active build style" = "any active build style";

/* Title for OK button in open panel used for choosing the install path. */
"Choose" = "Choose";

/* Title for open panel for choosing install location. */
"Choose Install Path" = "Choose Install Path";

/* Name of current system item in 'Target software runs on' popup. */
"Current System" = "Current System";

/* Name of current system item in 'Target is built with' popup. */
"Current System's" = "Current System's";

/* Human-readable label for FRAMEWORKS_SEARCH_PATHS key */
"Frameworks" = "Frameworks";

/* Label of the 'GCC Compiler Settings' target module */
"GCC Compiler Settings" = "GCC Compiler Settings";

/* Label of the 'General Settings' target module */
"General Settings" = "General Settings";

/* Human-readable label for HEADER_SEARCH_PATHS key */
"Headers" = "Headers";

/* Label of target settings module 'Installation Location' */
"Installation Location" = "Installation Location";

/* Label of the 'Java Archive Settings' target module */
"Java Archive Settings" = "Java Archive Settings";

/* Human-readable label for JAVA_CLASS_SEARCH_PATHS key */
"Java Classes" = "Java Classes";

/* Label of the 'Java Compiler Settings' target module */
"Java Compiler Settings" = "Java Compiler Settings";

/* Human-readable label for LIBRARY_SEARCH_PATHS key */
"Libraries" = "Libraries";

/* Label of the 'Ld Linker Settings' target module */
"Linker Settings" = "Linker Settings";

/* Description of -O2 optimizations */
"Most optimizations not requiring a space-time trade-off (same as Simple optimizations, plus common subexpression elimination, strength reduction, and iteration variable elimination)." = "Most optimizations not requiring a space-time trade-off (same as Simple optimizations, plus common subexpression elimination, strength reduction, and iteration variable elimination).";

/* Description of -O0 optimizations */
"No optimization.  This produces the most debuggable code, but should not be used for shipping code." = "No optimization.  This produces the most debuggable code, but should not be used for shipping code.";

/* Description of -O3 optimizations */
"Optimization for code size as opposed to speed.  This is the recommended option for shipping code, because the reduced code size often also results in speed gains due to better VM use." = "Optimization for code size as opposed to speed.  This is the recommended option for shipping code, because the reduced code size often also results in speed gains due to better VM use.";

/* Description of -O3 optimizations */
"Optimization for speed as opposed to code size.  May add aggressive function inlining, which is why it should be used with care." = "Optimization for speed as opposed to code size.  May add aggressive function inlining, which is why it should be used with care.";

/* Label of the 'Search Paths' target module */
"Search Paths" = "Search Paths";

/* Description of -O optimizations */
"Simple optimizations, such as automatic register allocation, jump threading, and deferred argument pops." = "Simple optimizations, such as automatic register allocation, jump threading, and deferred argument pops.";

/* Substring that will become part of the target build setting notice to represent the active build style; arg 1 is the name of the active build style */
"the active build style, '%@'" = "the active build style, '%@'";

/* Notice shown in target editor about the fact that the build settings in the target can be overridden; arg 1 is the localized string representing either the active build style or the notion of any build style, arg 2 is the name of current active target */
"The build settings in this editor show what is defined for this target.  When building from within Xcode, some of these settings are currently being overridden by settings defined in %@ (these settings are shown crossed-out).  When building for installation (using 'pbxbuild install -target %@' in a Terminal window), the in this editor will be used." = "The build settings in this editor show what is defined for this target.  When building from within Xcode, some of these settings are currently being overridden by settings defined in %@ (these settings are shown crossed-out).  When building for installation (using 'pbxbuild install -target %@' in a Terminal window), the in this editor will be used.";

